app/controllers/friends_controller.rb

SELECT `friends`.* FROM `friends`
---
  def index
    @friends = Friend.all

SELECT `friends`.* FROM `friends` WHERE (name LIKE'%Venkat%')
---
  def search
    @friends = Friend.where("name LIKE?", "%" + params[:q] + "%")

INSERT INTO `friends` (`name`, `email`, `phone`, `created_at`, `updated_at`) VALUES ('Ajay Kumar', 'ajay@mobicip.com', '9218909122', '2024-04-18 10:05:31.001042', '2024-04-18 10:05:31.001042')
---
  def create
    @friend = Friend.new(friend_params) # A new instance of the friend model is created.

    respond_to do |format|
      if @friend.save  # This saves the data in the table

UPDATE `friends` SET `friends`.`email` = 'cho@itlugundu.com', `friends`.`updated_at` = '2024-04-22 19:17:28.354428' WHERE `friends`.`id` = 4
---
  def update
    respond_to do |format|
      begin
        if @friend.update(friend_params)  # updated the user details

DELETE FROM `friends` WHERE `friends`.`id` = 26
---
  def destroy
    @friend.destroy!  # deletes the user

SELECT `friends`.* FROM `friends` WHERE `friends`.`id` = 18 LIMIT 1
---
    def set_friend
    begin
      @friend = Friend.find(params[:id])