app/controllers/sessions_controller.rb

  def create
    user = Admin.find_by(email: params[:email])
---
SELECT `admins`.* FROM `admins` WHERE `admins`.`email` = 'admin@gmail.com' LIMIT 1